import React from 'react';

import style from '../../assets/style/scss/homepage/homepage.module.css'
import CategoryBar from "./category-bar/category-bar";
import Sliderr from "./main-content/slider/slider";
import {NavLink} from "react-router-dom";
import WayBlock from "../way-block/way-block";

const Homepage = () => {

    const slider_urls = require('../../data/sliders-image-src.json')

    return (
        <div className={style.main}>
            <div className={style.main__leftbar}>
                <CategoryBar/>
            </div>
            <div className={style.main__content}>
                {/*<h3 className={style.title}><NavLink to={'/'}>Резистори</NavLink></h3>*/}
                {/*<Sliderr data={slider_urls[0]}/>*/}
                {/*<h3 className={style.title}><NavLink to={'/'}>Транзистори</NavLink></h3>*/}
                {/*<Sliderr data={slider_urls[1]}/>*/}
                <WayBlock data={[
                    {name: "Головна", url: "/home"}
                ]}/>
                <br/>
                <p><b>Вітаємо вас на сайті інтернет-магазину "RadioTapock" !</b></p>
                <p>RadioTapock – це інтернет-магазин електронних компонентів і приладів, який був заснований у 2021 р.
                    На сьогодні ми пропонуємо такі електронні компоненти: дроселі, мікросхеми, транзистори, діоди, резистори, конденсатори, вимірювальні прилади, флюс, роз'єми, варистори, світлодіоди, датчики, кнопки, радіолампи, магніти, реле механічні та електронні, джерела живлення та багато іншого.</p>
                <p>Послуги магазину:</p>
                <ul>
                    <li>до товарів є фотографії, опис та документація;</li>
                    <li>кількість товару та ціни, які вказані на сайті, завжди актуальні. Тому вам не потрібно чекати дзвінка менеджера, щоб дізнатися про наявність товару чи актуальність цін;</li>
                    <li>мінімальна вартість замовлення – 40 грн;</li>
                    <li>товари, які є в наявності, знаходяться на нашому складі та резервуються автоматично при оформленні замовлення. Це гарантує відправлення замовлення протягом 1-2 робочих днів;</li>
                    <li>якісна упаковка замовлень гарантує їх доставку без пошкоджень;</li>
                    <li>ми оперативно доставляємо оформлені замовлення в будь-яку область України (за допомогою логістичних служб "Нова Пошта", "Укрпошта");
                    </li>
                    <li>також можливий самостійний вивіз придбаної продукції покупцем зі складу магазину (точну адресу повідомить менеджер);
                    </li>
                    <li>у нашому колективі працюють компетентні продавці-консультанти, які не залишать вас без уваги. Всі консультації здійснюються безкоштовно.
                    </li>
                </ul>

                <p>Зробити покупку різних компонентів, можна всього в кілька кліків. Для цього вам навіть не потрібно виходити зі свого будинку чи залишати робоче місце.</p>
                <p>Тому вибирайте потрібні товари й ми чекаємо на ваше замовлення!</p>

                <img src={'https://upload.wikimedia.org/wikipedia/commons/f/f8/Soldering_a_0805.jpg'}/>

            </div>

        </div>
    );
};

export default Homepage;