import React from 'react';

import style from '../../assets/style/scss/vidgyky/vidgyky.module.css'
import WayBlock from "../way-block/way-block";
import VidgykyItem from "./vidgyku-item/vidgyky-item";

const Vidgyky = () => {

    const arr = [
        {
            name: "Михаил Слинько",
            data: "01.05.2021",
            resp: "Все якісно і швидко. Рекомендую."
        },
        {
            name: "Олександр",
            data: "09.03.2021",
            resp: "Інтернет-магазин працює напрочуд організовано та оперативно. Замовлені радіодеталі опрацьовані й відправлені досить швидко, у чіткій відповідності до змісту замовлення. Запропоновані магазином ціни доступні та по багатьом позиціям нижчі, ніж в інших інтернет-магазинах України.\n" +
                "РЕКОМЕНДУЮ !!!"
        },
        {
            name: "Громко Виктор",
            data: "09.03.2021",
            resp: "Хороший магазин, ввічливий, професійний менеджер. Асортимент широкий, ціни нормальні, Все оперативно відправили, № ТТН без нагадувань. Купував за передоплатою, заслуговують на довіру. Покупкою дуже задоволений. Дякую. Однозначно рекомендую магазин для покупок."
        },
        {
            name: "Олександр",
            data: "21.01.2021",
            resp: "Приємно здивований роботою магазину. За півтори голини після оформлення замовлення необхідні мені деталі вже були в мене. Адміністрація швидко відповідає на повідомлення. Найкращий магазин у Франківську. Рекомендую!\n"
        },
        {
            name: "Антон",
            data: "20.11.2020",
            resp: "Замовлення товару, звязок із менеджером та оформлення замовлення зайняли 5 хвилин. На всі питання компетентно отримав необхідні відповіді. Через дві години забрав товар зустрівшись в Івано-Франківську. Рекомендую магазин та дякую за оперативність.\n"
        },
        {
            name: "Михайло",
            data: "26.11.2018",
            resp: "Замовляв тут вперше, відправили через Укрпошту без питань, отримав, спаяв все працює. Магазин працює оперативно. Магазином задоволений як і товаром, надалі буду замовляти в даному магазині оскільки є потрібний мені асортимент і низькі ціни.\n"
        }
    ]

    let item = arr.map(i => <VidgykyItem date={i} key={i.resp}/>)

    return (
        <div className={style.main}>
            <WayBlock data={[
                {name: "Головна", url: "/home"},
                {name: "Відгуки", url: "/responds"}
            ]}/>
            <div>
                {item}
            </div>
            
        </div>
    );
};

export default Vidgyky;